---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArray.Clear
source: html/7f372fba-ea95-d05d-e3bd-3988442db54d.htm
---
# Autodesk.Revit.DB.ModelCurveArray.Clear Method

Removes every model curve from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```